# CannotCreateAnalyticalGeometry Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..CannotCreateAnalyticalGeometry Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Cannot construct Analytical Geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateAnalyticalGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateAnalyticalGeometry As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateAnalyticalGeometry {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace